[
 {
        "title": "Private vs public keys and what are cryptocurrencies anyway",
        "banner": "https://i.imgur.com/zidNb1b.jpg",
        "author": {
            "name": "Tristan Spearing",
            "avatar": "https://ca.slack-edge.com/T07PJD1FZ-U01JJ677TL0-88e284149aec-512"
        } ,
        "content": "<div class=\"entry-content\"><p>A lot of confusion is caused by images of gold coins with the Bitcoin symbol on them. It gives the impression that bitcoins are physical things. This couldn’t be further from fact.</p><p>In truth, cryptocurrencies exist on blockchains and are accessed through the use of private and public keys.</p><p>What’s a blockchain? Think of it as a record of who owns what. Understanding how a blockchain works isn’t mandatory for using one, just like it’s possible to use a computer without understanding how to program an operating system. The blockchain shows every owner of every single coin (or fraction of a coin). On the blockchain, the &quot;owner&quot; of the funds is identified by a public key.</p><br><p style=font-size:23px;>What’s the difference between private and public keys?</p><p>Coins are accessed by having a private key which corresponds to a public key. Think of the private key as the “password” and the public key as the account number. If you lose your private key, you lose access to your coins.</p><p>When someone says, &quotI own X amount of Y cryptocurrency&quot, what they really mean is &quotI have the password (private key) for an account (public key) which has X number of coins on the blockchain of Y cryptocurrency&quot</p><p>There are many blockchains in existence which facilitate cryptocurrencies and other applications.</p><p>Crypto wallets make it easy to store and manage cryptocurrencies. Some are mobile or desktop applications while others are just paper based. Wallets are the interface between both the private and public keys and the blockchain.</p><p>Let’s take a look at the wallet app for thenewboston cryptocurrency as an example:</p><br><p>As the name suggests, the public key is public, and therefore, visible. In this wallet, the public key is called “My Account Number”. If someone wanted to send coins to this account (which they would do with the “Send Coins” button in the top right), they would use the public key string of characters.</p><p>Note the button next to &quotMy Account Number&quot. This is used to copy the key to the clipboard and should be used rather than typing it out. Both private and public keys need to be exactly correct in order to work as expected and both are case sensitive. There is also a QR code, which can be scanned to copy the public key.</p><p>As the private key is a secret, and must remain so, it’s hidden by a string of * characters. For added security, it’s possible to copy the key to the clipboard or download it without even seeing what it is. This extra precaution is taken in case there is malware on the computer which has access to the screen and could steal the key. If someone else gains access to your private key, they gain access to your coins.<strong>For this reason, it’s important to never share your private keys with anyone.</strong></p><p>When working with any type of cryptocurrency, it’s important to backup the private key by saving it elsewhere.</p><br><p style=font-size:23px;>Back to the blockchain</p><p>Imagine someone sends the above account number (public key) 100 000 coins. The transferral of the coins would show on the blockchain going from the sender’s account number to the above account number. As the transaction is on the blockchain, it’s public information.</p><p>While that level of transparency may seem strange at first, it highlights one of the differences between the traditional system of exchange and cryptocurrency. You are presently reading this blog post on a device of some sort. It’s possible to discern that the device was purchased and who the buyer and seller are, but not how much was paid. The parties involved with the transaction can be known but the price is private. The difference with cryptocurrency is that the parties involved are private, but the price is public.</p><p>Note that it’s possible to have multiple accounts within one wallet. In fact, for security and privacy purposes, it’s prudent to use multiple accounts when working with cryptocurrencies. If you only use one account and it is compromised, all the coins would be at risk.</p><p>A common question is, “If someone knows my public key, could they figure out my private key?” The short answer is no. Thanks to asymmetric encryption, which means that it’s easy to go from private to public but not the other direction, it’s basically impossible to find the private key from a public key. Satoshi Nakamoto, the inventor of Bitcoin, owns approximately $60 billion worth of bitcoin as of February 2021. All their public keys are available on the blockchain, yet no one has been able to access their fortune.</p><p>With the advancement of blockchain technology, passing coins back and forth is just the beginning of the potential uses. Texting apps, games, and other banking processes are also being incorporated into the blockchain.</p><p style=font-size:20px;>For more information about thenewboston coin check out the announcement video</p><p><a href=https://www.youtube.com/watch?v=D-3i1g5YFik target=_blank>(https://www.youtube.com/watch?v=D-3i1g5YFik)</a> and our Facebook<br> <a href=https://www.facebook.com/TheNewBoston-464114846956315 target=_blank>(https://www.facebook.com/TheNewBoston-464114846956315/)</a>,LinkedIn<br> <a href=https://www.linkedin.com/company/thenewboston-developers target=_blank> (https://www.linkedin.com/company/thenewboston-developers/)</a>, Twitter<br> <a href=https://twitter.com/bucky_roberts target=_blank>(https://twitter.com/bucky_roberts)</a>, Reddit <a href=https://www.reddit.com/r/thenewboston/ target=_blank>(https://www.reddit.com/r/thenewboston/)</a> and Youtube <a href=https://www.youtube.com/user/thenewboston target=_blank>(https://www.youtube.com/user/thenewboston)</a> pages.</p></div> ",
        "datePosted": "03-23-2021",
        "readTime": "4 min read"
    },
  {
        "title": "How other countries are facilitating crypto",
        "banner": "https://i.imgur.com/FBtdxx8.jpg",
        "author": {
            "name": "Mieszko",
            "avatar": "https://ca.slack-edge.com/T07PJD1FZ-U01M21J2E7J-75de79a7078a-512"
        } ,
        "content": "<div class=\"entry-content\"><br><br><p>Across the world, individuals, businesses, banks, and governments have responded to the advent of blockchain technology and cryptocurrency in different ways. Let’s take a look at five unique cases.<p><br><p style=font-size:25px>Venezuela </p><p>From the late 2010’s through to the present day, the Venezuelan Bolívar has experienced hyperinflation, meaning that the buying power of the currency dropped drastically. It is estimated that the inflation rate was over 10,000,000% across 2018 and 2019, and over 1,000,000% in 2020.<br>The savings of the nation are destroyed during a hyperinflation event. Cash loses its purchasing power and becomes worthless. In Germany during the Weimar Republic for example, children used piles of money to build forts. Others burned cash for heat. While fiat currencies lose value, hard assets rise in value with inflation. Traditionally, real estate and commodities such as gold and silver have provided some protection amid hyperinflation. <br>During this turbulent time, another option emerged: cryptocurrency. By 2020, Venezuela had the 3<sup>rd</sup> highest crypto trading volume worldwide, behind only the United States and Russia.<br>Unlike real estate, cryptocurrency can’t be seized by the government as it resides on the blockchain and unlike gold and silver, it isn’t heavy or difficult to transport safely.<br>Another benefit to crypto is that it can easily be broken down into very small fractions of a coin. It is difficult to cut real estate or a gold coin in half, but like with fiat currency, fractional division is a simple feature of cryptocurrency. Through crypto, Venezuelans have been able to preserve their purchasing power in a manner which is cryptographically secure.<br>While cryptocurrencies tend to be quite volatile, going up and down in large swings, they beat currencies which experience hyperinflation and only go down.</p><p style=font-size:25px>Dubai</p><p>Kiklabb is a government owned entity in Dubai which provides licences to foreign businesses setting up shop in their economic free zones.<br>In 2020, they began accepting payments remotely to curb the spread of Covid-19. In 2021, they made it possible for these payments to be made in cryptocurrency.<br>The expectation is that other government offices within the United Arab Emirates will follow suit.</p><p style=font-size:25px;>Canada</p><p>The Ontario Securities Commission recently approved two Bitcoin based Exchange Traded Funds (ETFs).<br>ETFs are traditional investment vehicles which are regulated by the government. The fact that crypto based ETFs now exist is an incredible step towards taking cryptocurrency mainstream.</p><p style=font-size:25px;>The Philippines</p><p>In the Philippines, the Cagayan Special Economic Zone is a government owned area which was the first to offer hosting to financial technology companies. Now the zone is creating &quot;The Crypto Valley of Asia&quot; with the goal of attracting international blockchain companies.<br>The CEO of the economic zone, Raul L. Lambino, stated, &quot;Encouraged by Silicon Valley in San Francisco, we are making CEZA a sandbox for the development of these disruptive technologies, serving as a laboratory for interested parties to experiment on these new dimensions of business enterprise.&quot;<br>Like the ETFs in Canada, this is another case of the government embracing cryptocurrency and finding ways to integrate new technology into institutions which already exist.</p><p style=font-size:25px;>Switzerland</p><p>Zug, Switzerland has a new nickname: &quot;Crypto Valley&quot;. The canton has attracted many companies due to their blockchain friendly regulations.<br>In February 2020, the authorities started allowing residents to pay their taxes with cryptocurrency. Their financial director Heinz Tannler stated, &quot;As the home of the Crypto Valley, it is important to us to further promote and simplify the use of cryptocurrencies in everyday life&quot;.</p><p>From the above examples, it is clear to see that the adoption of cryptocurrency is taking place all over the world. Individuals are finding ways to preserve their wealth and governments are integrating cryptocurrency into their services.</p></div> ",
        "datePosted": "03-15-2021",
        "readTime": "3 min read"
    },
  {
        "title": "How useful is crypto currency in the real world",
        "banner": "https://i.imgur.com/1YEYbMu.jpg",
        "author": {
            "name": "Mieszko",
            "avatar": "https://ca.slack-edge.com/T07PJD1FZ-U01M21J2E7J-75de79a7078a-512"
        } ,
        "content": "<div class=\"entry-content\"><p>TheNewBoston (TNB) is a digital currency that is independent from banks. Unlike Bitcoin, TNB has low transaction fees (currently 2 cents) and transactions are instant- compared to Bitcoin’s $10+ fees and 10 minute waiting times.</p><p>Fiat money can be spent anywhere. We can only pay with crypto currency like TheNewBoston where it is accepted.</p><br><h2>Shopping</h2><br><p>Many websites accept Bitcoin- but as long as they accept Bitcoin you can pay with any crypto currency using a swap service. More information further down.</p><p>Here are just a few of the services that you can use with crypto currency:</p><p style=font-size:20px;>Server Hosting</p><p>Evolution Host (evolution-host.com) offers a range of services for developers: Virtual Private Servers, game servers and DDoS protection for your services.</p><p style=font-size:20px>Etsy</p><p>Etsy is a marketplace for home made products. Not all Etsy sellers accept crypto currency- but many do! Etsy sellers offer a wide range of products: clothes, baskets, exoitic plants, mugs and more.</p><p>Interested in home-made products? Head over to <a href=https://www.etsy.com target=_blank>etsy.com!</a></p><p style=font-size:20px>Amazon</p><p>Need something from Amazon? Pay with crypto using <a href=https://www.purse.io target=_blank>purse.io</a>.</p><p>Purse is simple. You request an item from Amazon- at a discount- and other users offer their Amazon gift cards for your crypto currency. Purse does its magic and they get your crypto currency, you get your Amazon item!</p><p style=font-size:20px>Newegg</p><p>Upgrading your computer? Newegg accepts crypto currency!</p><p>Newegg sells all kinds of products: computer parts, smart appliances, laptops VR headsets and more! It’s a global company with international shipping.</p><p style=font-size:20px>Destinia</p>Book cheap flights and hotels with Bitcoin!<p></p><p style=font-size:20px>Spending Bitcoin</p><p>Spendingbitcoin.com is a niche search engine for online stores that accept Bitcoin- there are thousands of them!</p><h2>Trading</h2><br><p>Online fiat transactions tend to be reversible. Platforms such as PayPal and credit card services allow the sender to charge back transactions.</p><p>Therefore, trading online- such as for items on Minecraft or Steam- is best done with crypto currency. Once a crypto transaction is completed, it cannot be reversed.</p> <h2>Investing</h2><br><p>TheNewBoston (TNB) is a community of developers creating a new crypto currency together. It’s blazingly fast. Transactions are dirt cheap. Tokens are distributed to the people creating the currency. Mining based crypto currencies (like Bitcoin) waste energy to create new tokens. No electricity is wasted to mint TNB currency.</p><p>Buying TheNewBoston (TNB) currency from contributors means that you’re paying contributors for their work and supporting open source projects. When the token’s value inevitably goes up- currently 0.02 USD up from 0.01 USD, you can sell them to make a profit and provide market liquidity by doing so.</p><p>Investing isn’t just about money- you can invest your time too! TheNewBoston contributors are paid 2800 tokens daily for their contributions. Head over to TheNewBoston.com to learn more.</p><p>To invest in TheNewBoston, head over to <a href=https://thenewboston.com>thenewboston.com</a> and join the Slack & Discord servers (both have escrow supported #trade channels), and head over the exchange server listed below.</p><h2>Crypto Swap</h2><br><p>Need to pay with Bitcoin but got Litecoin instead? Use a swap service. These work by accepting your crypto currency and sending back the equivalent value in another crypto currency.</p><p>Standard exchanges typically require you to make an account. Mieszko Exchange is an upcoming instant swap service with no registration that will allow you to swap your TheNewBoston coins for Bitcoin and Litecoin- and vice versa. Head over to <a href=https://discord.gg/3SAHqTBKyx>discord.gg/3SAHqTBKyx</a> to learn more.</p><h2>Summary</h2><br><p>Crypto currency is very much useful and real world ready. It isn’t something we just hold on to for investments. Many online stores accept it and receiving crypto currency is the safest way to trade online. Classical crypto currencies such as Bitcoin have high transaction fees- and they’re slow! But new age currencies like TheNewBoston solve these issues.</p></div> ",
        "datePosted": "03-08-2021",
        "readTime": "3 min read"
    }, 
   {
        "title": "Comparison between Cryptocurrency and Dollar",
        "banner": "https://i.imgur.com/D989PSy.jpg",
        "author": {
            "name": "ijeoma",
            "avatar": "https://secure.gravatar.com/avatar/2b63dd52f52192b9b84290f3e2ecc51c?s=80&d=identicon&r=g"
        },
        "content": "<div class=\"entry-content\"><p> Last time,we opened a bit on what cryptocurrency is, as well as Bitcoin and its advent.Well, today, we will be comparing Bitcoin to the United States Dollar. &nbsp; </p></div><p> First,we understand cryptocurrency to be,put quite simply, a digital currency;while the US dollar is an official currency backed by the government,as are other government - backed national currencies.We are going to attempt to address the differences between both currencies.</p> <p> 1. In link to <strong> what is a cryptocurrency </strong>, we discussed how cryptocurrency is decentralized (it is not owned or regulated by any known or centralized authority). Well, when it comes to the US dollar, the difference is quite clear. The dollar is owned and regulated by the United States government.&nbsp;</p> <p> 2. Another obvious dissimilarity between the two currency forms would be tangibility.While you can hold on to the touch, and feel it, if for any reason you find yourself holding onto any cryptocurrency,you’ ve been had!Cryptocurrency is only digital,while the fiat is both digital and tangible. </p><p> 3. Again,the various cryptocurrencies have a limit to the amount that could be in existence,while the dollar has an unlimited supply which means the central authority has no cap to the extent to which they can produce money. </p><p> 4. Since we have clarified and emphasized the digitality of cryptocurrency,it goes without saying that the method of storage would be digital as well.Making use of digital wallets(cryptocurrency wallets).This is not so with the dollar,which leans on the existence of banks and the Central Bank. </p><p> 5. Also,transactions using the fiat currency(dollar) can be reversed or charged back.This is seldom so when it comes to cryptocurrency. </p> <p> In our current clime and time,though,both serve as a means of exchange and a store of value,whilst relying on widespread consumer use for proper functionality.This is the most common similarity between the two currencies. &nbsp; </p><p> We have come to the end of this week’ s edition.Stay tuned or our next blog post coming up next week, it promises to be very informative.To get more information about thenewboston coin, click <a href = \"https://www.youtube.com/watch?v=D-3i1g5YFik\" > here </a> or follow us on <a href=\"https://www.facebook.com/TheNewBoston-464114846956315/\">Facebook</a>,<a href=\"https://www.linkedin.com/company/thenewboston-developers/\">LinkedIn</a>, <a href=\"https://twitter.com/bucky_roberts\">Twitter</a>, <a href=\"https://www.reddit.com/r/thenewboston/\">Reddit</a>, <a href=\"https://www.youtube.com/user/thenewboston\">YouTube</a>. You can also join the newBoston community <a href=\"https://join.slack.com/t/thenewboston/shared_invite/zt-kjaspi4k-ah6GEJUabA31Hn4DAeng5w\">here</a> to pitch a project or contribute to existing projects.</p> </div>",
        "datePosted":"02-17-2021", 
        "readTime": "6 min read"
    },
    {
        "title": "How Cryptocurrency Works",
        "banner": "https://i.imgur.com/Ypt83Bd.jpg",
        "author": {
            "name": "chibuzor",
            "avatar": "https://secure.gravatar.com/avatar/b63a7613761e31f2258b3a2f361933ba?s=100&r=pg&d=mm"
        },
        "content": "<div class=\"entry-content\"><p>Cryptocurrency, usually referred to as &quot;Digital Currency&quot; would not be expected to operate just the same as Fiat(normal currency). There are methods of operations unique to it.<br>The most basic way to describe how Cryptocurrency operates would be a Register or Ledger. In that, every transaction is logged and verified. This is made possible through the means of a public ledger identified as Blockchain.<br>The Blockchain keeps track of all transactions made and updated in real-time. So each time a cryptocurrency unit is purchased, this is logged and verified by &quot;miners&quot;, and this applies to further transactions made.<br> As much as the identity of the user is mostly private, all transactions made from most cryptocurrency wallets are well logged into the public ledger (Blockchain).<br>Essentially, Blockchain is the technological foundation on which cryptocurrency operates. <br> <p>&quot;Miners&quot;, as mentioned earlier, are specific individuals or &quot;nodes&quot; whose jobs are to verify unconfirmed transactions to add them to the blockchain. Cryptocurrencies like Bitcoin and Ethereum usually take a minimum of three confirmations before a transaction is verified and allowed to take place.</p><p>The easiest way to explain this even more clearly would be to take a look at a statement made by Vitalik Buterin, the Creator of Ethereum;<br>&quot;Whereas most technologies tend to automate workers on the periphery doing menial tasks, blockchains automate away the centre. Instead of putting the taxi driver out of a job, blockchain puts Uber out of a job and lets the taxi drivers work with the customer directly.&quot;</p></div>",
        "datePosted": "03-01-2021",
        "readTime": "1 min read"
    },
    {
        "title": "Cryptocurrency 101: Summary of the history and uses of cryptocurrency.",
        "banner": "https://i.imgur.com/NxPc8pw.jpg",
        "author": {
            "name": "chibuzor",
            "avatar": "https://secure.gravatar.com/avatar/b63a7613761e31f2258b3a2f361933ba?s=100&r=pg&d=mm"
        },
        "content": "<div class=\"entry-content\"><p>Generally, when the question: “what exactly is a cryptocurrency” comes up, it is easy to reply; “Digital Currency”. Well, yes, but no. Let’s start at the top.&nbsp;Basically, cryptocurrency is the usage of digital files as money/currency. The name is coined from two terms:</p><p><strong>Cryptography: </strong>The science of hiding information</p><p><strong>Currency: </strong>Accepted system of money.</p><p>Think you can properly define what a cryptocurrency actually is now? Exactly, “Digital Currency” is easier.</p> <p>The idea of a cryptocurrency first came up in 1980, based on making anonymous transactions that would not require centralized authorities like Banks. Building on this notion, the first cryptographic electronic currency was developed, called <strong><em>Digicash,</em></strong> by David Chaum, an American cryptographer, in 1995. In 1998, another e-currency called Bit Gold was designed by Nick Szabo.</p> <p>While the Digicash required specific software and encrypted keys before transactions could be made, the Bit Gold required it’s users to gain by dedicating digital power to solving cryptographic puzzles. Combining these two ideas, the basic concept of the first usable cryptocurrency; <strong>Bitcoin,</strong> was born. Although, this would not be untll a decade later.</p> <p>Due to the fact that neither Chaum nor Szabo could solve the authenticity issue of their cryptocurrency, progress in this field was stunted until a white paper titled <em>Bitcoin – A Peer to Peer Electronic Cash System</em>, was published by a person or group of persons under the pseudonym Satoshi Nakamoto, on 31<sup>st</sup> October, 2008. This heavily described the functionality of a workable cryptocurrency based on the usage of it’s Blockchain Technology. It is worth noting that neither Bitcoin nor any other subsequent cryptocurrency would be possible without the advent of the Blockchain Technology, but this is a topic for another day.</p>      <p>With Bitcoin truly underway and functional, other cryptocurrencies were being developed and launched, such as <strong>Litecoin </strong>and <strong>Namecoin</strong> in 2011, <strong>Peercoin </strong>in 2012 <strong>, Dogecoin, Primecoin, Ripple </strong>and <strong>NXT </strong>in 2013. Within the decade, a host of other digital currencies came into light with varying degrees of success. There are currently over <strong>2000</strong> Cryptocurrencies in existence.&nbsp;</p>  <p>Cryptocurrency, given it’s development and implementation, has to have a lot of <em>benefits </em>to go with the amount of work put into its development.</p>   <p>One of the most important benefits of Cryptocurrency would be Low-Cost Transaction Rates. For instance, a particularly recent $99 Million Litecoin transaction was made and concluded in just under 3 minutes, and cost the initiator of the transaction a whopping $0.40, yes, you read that right. <strong>40 cents! </strong>This makes cryptocurrency the go-to currency for international transactions.</p> <p>Another benefit would be <strong>Private Transactions.</strong> The idea of explaining why you’re spending a particular sum of your own money to the bank is irksome. Essentially, your transactions do not go through long bureaucratic processes, which makes for even swifter transactions.</p><p>The last benefit we would be discussing is <strong>Total Ownership of your Funds. </strong>Given the development and ‘decentralization’ concept of cryptocurrency, no central entity or authority could place a censor or freeze your financial assets. Since most of the time, all it takes for one’s accounts to be frozen are barely proven accusations, usage of cryptocurrency like Bitcoin, provides censor-resistant alternatives.</p></div> ",
        "datePosted": "02-21-2021",
        "readTime": "6 min read"
    }
  
]
