[
  {
    "openingId": "senior-python-django-developer",
    "category": "Engineering",
    "description": "We are looking for a Senior Python / Django Developer to help us build out both our digital currency network and Website API.",
    "position": "Senior Python / Django Developer",
    "responsibilities": [
      "Designing and creating RESTful APIs",
      "Participating in architectural, design and product discussions",
      "Working in an environment with an excellent team of engineers"
    ],
    "technologyRequirements": [
      "Experience with Celery, DRF, and pytest",
      "2+ years of experience in Django",
      "4+ years of experience in Python"
    ]
  },
  {
    "openingId": "ux-designer",
    "category": "Design",
    "description": "We’re looking for a creative and motivated UX designer that basically will help improve thenewboston.com web app.",
    "position": "UX Designer",
    "responsibilities": [
      "Creates innovative solutions for a wide variety of product design challenges, including Web design features.",
      "Plans and defines a strategy for the direction of future iterations.",
      "Advocates for design solutions, highlighting inputs that influenced the decisions including business and user goals, demographic and usage data, and research findings.",
      "Works alongside engineers and product managers throughout all stages of the production cycle.",
      "Develops and maintains detailed user interface specifications.",
      "Presents design work to multiple teams and senior leadership for review and feedback."
    ],
    "technologyRequirements": [
      "Fluency in best practices for web-based information architecture and design.",
      "Strong knowledge of usability principles and techniques.",
      "Excellent communication and presentation.",
      "Experience working in a collaborative multidisciplinary team and working directly with developers for implementation of designs.",
      "Figma is required and must understand how to manage style guides.",
      "Ability to work on improving design continuously."
    ]
  },
  {
    "openingId": "marketing-lead",
    "category": "Marketing",
    "description": "As a marketing lead, you will be in charge of leading our organization's marketing efforts. As a successful hire, you will be responsible for providing guidance to our marketing department by evaluating and developing marketing strategies, planning and coordinating marketing efforts, communicating the marketing plans to those involved, and building awareness and positioning for our organization's brands. You will also be working closely with our sales department to set up campaigns whenever community action is needed.",
    "position": "Marketing Lead",
    "responsibilities": [
      "Participate in the development of branding and corporate identity initiatives",
      "Develop and implement marketing plans, new product introductions and other marketing projects",
      "Develop and manage marketing budgets",
      "Develop branding plans and sales campaigns",
      "Establish and grow a target market share",
      "Monitor costs and budgets",
      "Conduct customer, brand and product research initiatives",
      "Offer expert advice to develop innovative advertising, public relations, social media and events",
      "Negotiate with media partners to guarantee advantageous contracts",
      "Work with new business development team and sales teams on all initiatives",
      "Manage agency providers, consultants, freelancers and other suppliers, including contract negotiation and management",
      "Demonstrate excellent communication and interpersonal skills",
      "Supervise a marketing team, including hiring, training, workloads, schedules and deadlines",
      "May oversee the operation of a company’s website or email marketing program and provide analytics review"
    ],
    "technologyRequirements": [
      "Strong interpersonal skills, verbal and written communication skills and most importantly empathy",
      "Review Member Conduct and Work Rules Policy"
    ]
  }
]
