[
  {
    "openingId": "react-native-developer",
    "category": "Engineering",
    "description": "Looking for a skilled React Native developer with 2+ years of experience building mobile apps for both Android and iOS. The ideal must have the following skills and must be able to perform the following roles and responsibilities.",
    "position": "React Native Developer",
    "responsibilities": [
      "Build pixel-perfect, buttery smooth UIs across both mobile platforms.",
      "Leverage native APIs for deep integrations with both platforms.",
      "Maintain code and write automated tests to ensure the product is of the highest quality."
    ],
    "requirements": [
      "Firm grasp of the JavaScript and its nuances, including ES6+ syntax",
      "Knowledge of functional or object-oriented programming",
      "Understanding of REST APIs, the document request model, and offline storage",
      "Familiarity with native build tools, like XCode, Gradle, Android Studio, IntelliJ",
      "Can work with third-party dependencies and debug dependency conflicts",
      "Experience with automated testing suites, like Jest or Mocha"
    ],
    "applicationUrl": "https://docs.google.com/forms/d/e/1FAIpQLSf4Mk-vxO3Nl193LkCSGPOrrT5uDvA27peH8du7hSnfUsxb0A/viewform"
  },
  {
    "openingId": "senior-python-django-developer",
    "category": "Engineering",
    "description": "We are looking for a Senior Python / Django Developer to help us build out both our digital currency network and Website API.",
    "position": "Senior Python / Django Developer",
    "responsibilities": [
      "Designing and creating RESTful APIs",
      "Participating in architectural, design and product discussions",
      "Working in an environment with an excellent team of engineers"
    ],
    "requirements": [
      "Experience with Celery, DRF, and pytest",
      "2+ years of experience in Django",
      "4+ years of experience in Python"
    ],
    "applicationUrl": "https://docs.google.com/forms/d/e/1FAIpQLSf4Mk-vxO3Nl193LkCSGPOrrT5uDvA27peH8du7hSnfUsxb0A/viewform"
  },
  {
    "openingId": "ux-designer",
    "category": "Design",
    "description": "We’re looking for a creative and motivated UX designer that basically will help improve thenewboston.com web app.",
    "position": "UX Designer",
    "responsibilities": [
      "Creates innovative solutions for a wide variety of product design challenges, including Web design features.",
      "Plans and defines a strategy for the direction of future iterations.",
      "Advocates for design solutions, highlighting inputs that influenced the decisions including business and user goals, demographic and usage data, and research findings.",
      "Works alongside engineers and product managers throughout all stages of the production cycle.",
      "Develops and maintains detailed user interface specifications.",
      "Presents design work to multiple teams and senior leadership for review and feedback."
    ],
    "requirements": [
      "Fluency in best practices for web-based information architecture and design.",
      "Strong knowledge of usability principles and techniques.",
      "Excellent communication and presentation.",
      "Experience working in a collaborative multidisciplinary team and working directly with developers for implementation of designs.",
      "Figma is required and must understand how to manage style guides.",
      "Ability to work on improving design continuously."
    ],
    "applicationUrl": "https://docs.google.com/forms/d/e/1FAIpQLSc2dbvqlUrU5liVK8_mYPI6PYPBT-_gMeQiRxDW7-Y7cXTFNg/viewform"
  },
  {
    "openingId": "technical-recruiter",
    "category": "Community",
    "description": "We're searching for a Technical Recruiter to join our HR team and assist us in expanding our IT teams. Technical Recruiter responsibilities will be to source, screen, and provide a shortlist of qualified applicants for various technical tasks are among the responsibilities of a technical recruiter.",
    "position": "Technical Recruiter",
    "responsibilities": [
      "Writing and publishing job descriptions and adverts for technical positions.",
      "Screening IT resumes by separating specialized talents and capabilities.",
      "Network with potential applicants both online and offline to promote our employer brand, shorten our time-to-hire, and guarantee we hire the best people.",
      "Using professional channels to find potential prospects (e.g. Github, Stack Overflow, LinkedIn etc).",
      "Conducting task and job analysis in order to document job responsibilities and needs.",
      "Enhancing our organization's reputation as a pleasant place to work.",
      "Creating and sending recruitment emails to passive prospects that are interested in current job openings.",
      "Conducting pre-screening interviews to assess candidates' abilities.",
      "Using a variety of methods to interview candidates.",
      "You will contribute to the development of a solid tech talent pipeline by assisting in the hiring and retention of qualified workers for our IT positions."
    ],
    "requirements": [
      "Working as a Technical Recruiter in the past is a plus.",
      "Solid technical background needed to understand as well as explain requirements for IT-related jobs.",
      "Expertise in a variety of sourcing techniques.",
      "Sound knowledge of all labor regulations and HR practices.",
      "Strong verbal and nonverbal communication skills.",
      "Experience in continuously developing talent pipelines and sourcing suitable people is a plus.",
      "It is recommended that you have a thorough understanding of and use of recruiting metrics to guide your decision-making.",
      "Ability to speak intelligently about the organization and respond to any technical inquiries posed by a possible hiring."
    ],
    "applicationUrl": "https://docs.google.com/forms/d/e/1FAIpQLSf4Mk-vxO3Nl193LkCSGPOrrT5uDvA27peH8du7hSnfUsxb0A/viewform"
  },
  {
    "openingId": "human-resources-head",
    "category": "Community",
    "description": "Our company is looking for a Head of Human Resources to join our team. to oversee all personnel-related matters and ensure we use our resources beneficially.",
    "position": "Head of Human Resources",
    "responsibilities": [
      "Working with team leads to write job descriptions.",
      "Overseeing the application process.",
      "Overseeing the interview process.",
      "Overseeing payments and accounting.",
      "Documenting standard memo conventions for payments.",
      "Assisting team leads with the onboarding process.",
      "Overseeing the creation of the new recruiting team."
    ],
    "requirements": ["Leadership abilities", "Familiar with Github", "Knowledgeable with Gsuite"],
    "applicationUrl": "https://docs.google.com/forms/d/e/1FAIpQLSf4Mk-vxO3Nl193LkCSGPOrrT5uDvA27peH8du7hSnfUsxb0A/viewform"
  },
  {
    "openingId": "marketing-specialist",
    "category": "Marketing",
    "description": "The Marketing Team is looking for a responsible Marketing Specialist that will help us with our daily tasks that keep the department functioning and facilitate the duties of the Head of Marketing.",
    "position": "Marketing Specialist",
    "responsibilities": [
      "Administrative duties",
      "Drive traffic from social media",
      "Execute marketing strategy",
      "Create reports on marketing performance",
      "Work with the marketing team to manage brand and marketing initiatives"
    ],
    "requirements": ["Gsuite", "Marketing tools", "Familiar with all social media"],
    "applicationUrl": "https://docs.google.com/forms/d/e/1FAIpQLSf4Mk-vxO3Nl193LkCSGPOrrT5uDvA27peH8du7hSnfUsxb0A/viewform"
  },
  {
    "openingId": "senior-seo-specialist",
    "category": "Marketing",
    "description": "We are looking for a talented Senior SEO Specialist to join our team.",
    "position": "Senior SEO Specialist",
    "responsibilities": [
      "Develop optimization strategies that improve the search engine results rankings",
      "Research SEO keywords to use throughout the website and marketing materials",
      "Collect data and report on traffic, rankings, and other SEO aspects",
      "Review technical SEO issues and recommend fixes",
      "Collaborate with others within the marketing team to manage SEO strategy",
      "Write compelling and high-quality website content, including blog posts and page descriptions",
      "Update content and website links for maximum optimization and search engine rankings"
    ],
    "requirements": [
      "3+ years of experience in successfully developing and executing SEO campaigns",
      "Understanding of search engine algorithms and ranking methods",
      "Experience with SEO industry programs, such as Google Analytics",
      "Knowledge of keyword research and data mining tools",
      "Able to complete competitive analysis of other organizations within the industry",
      "Excellent written and verbal communication skills",
      "Comfortable analyzing high volumes of data daily",
      "Expertise in WordPress."
    ],
    "applicationUrl": "https://docs.google.com/forms/d/e/1FAIpQLSf4Mk-vxO3Nl193LkCSGPOrrT5uDvA27peH8du7hSnfUsxb0A/viewform"
  },
  {
    "openingId": "marketing-strategy-specialist-nigeria",
    "category": "Marketing",
    "description": "Marketing Team is looking for Marketing Specialist from Nigeria to represent thenewboston policies and values in their home region and encourage people around the world to contribute and earn our coins.",
    "position": "Marketing Specialist Nigeria",
    "responsibilities": [
      "Submit a Bi-weekly Marketing Strategy that explains how you are going to promote thenewboston in facebook Group page.",
      "Create a Weekly Social Media Marketing Plan.",
      "Engage with your audience and encourage them to join in our community.",
      "Working with a team to discuss marketing ideas.",
      "Review the Group page analytics and Improved marketing strategy.",
      "Communicate and Engage with thenewboston Community."
    ],
    "requirements": ["Social Media Marketing tools", "G-suite"],
    "applicationUrl": "https://docs.google.com/forms/d/e/1FAIpQLSf4Mk-vxO3Nl193LkCSGPOrrT5uDvA27peH8du7hSnfUsxb0A/viewform"
  },
  {
    "openingId": "marketing-specialist-india",
    "category": "Marketing",
    "description": "Marketing Team is looking for Marketing Specialist from India to represent thenewboston policies and values in their home region and encourage people around the world to contribute and earn our coins.",
    "position": "Marketing Specialist India",
    "responsibilities": [
      "Submit a Bi-weekly Marketing Strategy that explains how you are going to promote thenewboston in facebook Group page.",
      "Create a Weekly Social Media Marketing Plan.",
      "Engage with your audience and encourage them to join in our community.",
      "Working with a team to discuss marketing ideas.",
      "Review the Group page analytics and Improved marketing strategy.",
      "Communicate and Engage with thenewboston Community."
    ],
    "requirements": ["Social Media Marketing tools", "G-suite"],
    "applicationUrl": "https://docs.google.com/forms/d/e/1FAIpQLSf4Mk-vxO3Nl193LkCSGPOrrT5uDvA27peH8du7hSnfUsxb0A/viewform"
  }
]
